app/controllers/firsts_controller.rb

    def create
        @total = QuestionResult.new
        @total.user_id = current_user.id
        if @total.total == nil
            @total.total = params[:id]
        else
            @total.total += params[:id]
        end
        respond_to do |format|
            if @total.save
---
INSERT INTO `question_results` (`total`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2021-04-22 04:21:05.914042', '2021-04-22 04:21:05.914042')