app/controllers/firsts_controller.rb

INSERT INTO `question_results` (`total`, `user_id`, `created_at`, `updated_at`) VALUES (0, 1, '2021-04-23 09:15:56.071774', '2021-04-23 09:15:56.071774')
SELECT `first_questions`.* FROM `first_questions` WHERE `first_questions`.`id` = 4 LIMIT 1
SELECT `first_answers`.* FROM `first_answers` WHERE `first_answers`.`first_question_id` = 2
SELECT `first_questions`.* FROM `first_questions` WHERE `first_questions`.`id` = 5 LIMIT 1
SELECT `first_questions`.* FROM `first_questions` WHERE `first_questions`.`id` = 2 LIMIT 1
SELECT `first_questions`.* FROM `first_questions` WHERE `first_questions`.`id` = 3 LIMIT 1
---
    def new
        @total = QuestionResult.find_by(user_id: current_user.id, question_type: 0)
        if @total == nil
            @total = QuestionResult.new(user_id: current_user.id, question_type: 0)
        elsif @total.total == nil
            @total.total = 0
        elsif @total.total != 0
            @total.total = 0
        end
        @total.save

        #各問題をdbから引っ張ってくる
        @first_question1 = FirstQuestion.find(1)
        @first_answers1 = FirstAnswer.where(first_question_id: 1)

        @first_question2 = FirstQuestion.find(2)
        @first_answers2 = FirstAnswer.where(first_question_id: 2)

        @first_question3 = FirstQuestion.find(3)
        @first_answers3 = FirstAnswer.where(first_question_id: 3)

        @first_question4 = FirstQuestion.find(4)
        @first_answers4 = FirstAnswer.where(first_question_id: 4)

        @first_question5 = FirstQuestion.find(5)
        @first_answers5 = FirstAnswer.where(first_question_id: 5)

        @first_question6 = FirstQuestion.find(6)

SELECT `question_results`.* FROM `question_results` WHERE `question_results`.`user_id` = 1 LIMIT 1
SELECT `question_results`.* FROM `question_results` WHERE `question_results`.`id` = NULL LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `question_results` SET `question_results`.`total` = 0, `question_results`.`updated_at` = '2021-04-24 05:10:31.408079' WHERE `question_results`.`id` = 1
---
    def create
        @total_score = QuestionResult.find_by(user_id: current_user.id, question_type: 0)
        @user = User.find_by(id: current_user.id)
        # nilだった場合DBにnilではなく0を代入
        if @total_score.total == nil
            @total_score.total = 100
        end
        #ajaxで送られてきたデータを代入
        @score_data = params[:id]
        #現在dbにある値と足して保存
        @update_score = @total_score.total - @score_data.to_i
        #update
        @total_score.update_column(:total, @update_score)