app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `users` (`name`, `email`, `crypted_password`, `salt`, `created_at`, `updated_at`) VALUES ('sss', 'sss@sss', '$2a$10$k87fKthYjU/JpnnTbdcZqeQh/bFVodiWR8mLT72rSPzEinGm7ka8S', 'wWWRmEB5EjSDKVzqS9-N', '2021-04-21 07:07:14.092938', '2021-04-21 07:07:14.092938')
---
    def index
        # ユーザー情報の取得
        @user = User.find_by(id: current_user)

        # recovery_question & recovery_answerの取得
        @recovery_question = RecoveryQuestion.where( 'id >= ?', rand(RecoveryQuestion.first.id..RecoveryQuestion.last.id) ).first
        @recovery_answers = RecoveryAnswer.where(recovery_question_id: @recovery_question)

        # 一問一答問題の質問と答え(このままだと同じ問題しか出ないのでfirstを変更する)
        @third_question = ThirdQuestion.order("RAND()").first
        @third_answers = ThirdAnswer.where(third_question_id: @third_question)

        #回答結果保存モデルへのインスタンス取得ないし初期化
        @total1 = QuestionResult.find_by(user_id: current_user.id, question_type: 2)
        if @total1 == nil
            @total1 = QuestionResult.new(user_id: current_user.id, question_type: 2)
        end
        @total1.save

INSERT INTO `users` (`name`, `email`, `crypted_password`, `salt`, `created_at`, `updated_at`) VALUES ('sss', 'sss@sss', '$2a$10$lA3i19Cs8SKpR3DIxMsm7OE6mnj6OHt5nwv7vkkZfdIMyhmm9DdmC', 'y7m8t38CziPU3J4AuD81', '2021-04-17 05:57:27.188254', '2021-04-17 05:57:27.188254')
---
    def create
        @user = User.create(user_params)